; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v7 ?v1)
             (pred_5 ?v2 ?v11)
             (pred_1 ?v7 ?v11)
             (pred_10 ?v10 ?v7 )
	     (pred_11 ?v7)
             (pred_7 ?v9)
             (pred_2 ?v2)
             (pred_8 ?v11)
             (pred_6 ?v7)
             (pred_3 ?v2)
             (pred_9 ?v7)
             (pred_4 ))



(:action op_3
:parameters (?v3 ?v4 ?v5 ?v6)
:precondition (and (pred_7 ?v3) (pred_7 ?v4) (pred_2 ?v5) (pred_8 ?v6)
          (pred_12 ?v3 ?v4) (pred_5 ?v5 ?v6)
                   (pred_1 ?v4 ?v6) (pred_11 ?v3) 
                   (pred_6 ?v4) (pred_3 ?v5))
:effect (and  (pred_9 ?v4) (not (pred_6 ?v4))))


(:action op_5
:parameters (?v3 ?v8)
:precondition (and (pred_7 ?v3) (pred_7 ?v8)
               (pred_11 ?v3) (pred_12 ?v3 ?v8) (pred_9 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v3))))

(:action op_2
:parameters (?v3 ?v5)
:precondition (and (pred_7 ?v3) (pred_2 ?v5) 
                  (pred_11 ?v3) (pred_10 ?v5 ?v3) (pred_4 ))
:effect (and (pred_3 ?v5)
   (not (pred_10 ?v5 ?v3)) (not (pred_4 ))))


(:action op_4
:parameters (?v3 ?v12 ?v13)
:precondition (and (pred_7 ?v3) (pred_2 ?v12) (pred_2 ?v13)
                  (pred_11 ?v3) (pred_3 ?v13) (pred_10 ?v12 ?v3))
:effect (and (pred_3 ?v12) (pred_10 ?v13 ?v3)
        (not (pred_3 ?v13)) (not (pred_10 ?v12 ?v3))))

(:action op_1
:parameters (?v3 ?v5)
:precondition (and (pred_7 ?v3) (pred_2 ?v5) 
                  (pred_11 ?v3) (pred_3 ?v5))
:effect (and (pred_4 ) (pred_10 ?v5 ?v3) (not (pred_3 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_16 obj_14 obj_05 obj_01 obj_20 obj_04 obj_13 obj_15 obj_12 obj_07 obj_19 obj_17 obj_10 obj_06 obj_11 obj_03
    obj_08 obj_02
    obj_18 obj_09
    )

    (:init
       (pred_4)

       (pred_7 obj_16)
       (pred_7 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_01)
       (pred_7 obj_20)
       (pred_7 obj_04)
       (pred_7 obj_13)
       (pred_7 obj_15)
       (pred_7 obj_12)
       (pred_7 obj_07)
       (pred_7 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_10)
       (pred_7 obj_06)
       (pred_7 obj_11)
       (pred_7 obj_03)
       (pred_8 obj_08)
       (pred_8 obj_02)
       (pred_2 obj_18)
       (pred_2 obj_09)

       (pred_12 obj_16 obj_20)
       (pred_12 obj_16 obj_14)
       (pred_12 obj_14 obj_04)
       (pred_12 obj_14 obj_05)
       (pred_12 obj_14 obj_16)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_05 obj_01)
       (pred_12 obj_05 obj_14)
       (pred_12 obj_01 obj_15)
       (pred_12 obj_01 obj_05)
       (pred_12 obj_20 obj_12)
       (pred_12 obj_20 obj_04)
       (pred_12 obj_20 obj_16)
       (pred_12 obj_04 obj_07)
       (pred_12 obj_04 obj_13)
       (pred_12 obj_04 obj_14)
       (pred_12 obj_04 obj_20)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_13 obj_04)
       (pred_12 obj_15 obj_17)
       (pred_12 obj_15 obj_01)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_12 obj_10)
       (pred_12 obj_12 obj_07)
       (pred_12 obj_12 obj_20)
       (pred_12 obj_07 obj_06)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_07 obj_04)
       (pred_12 obj_07 obj_12)
       (pred_12 obj_19 obj_11)
       (pred_12 obj_19 obj_17)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_17 obj_03)
       (pred_12 obj_17 obj_15)
       (pred_12 obj_17 obj_19)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_12)
       (pred_12 obj_06 obj_11)
       (pred_12 obj_06 obj_07)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_11 obj_19)
       (pred_12 obj_11 obj_06)
       (pred_12 obj_03 obj_17)
       (pred_12 obj_03 obj_11)
       (pred_6 obj_04)
       (pred_6 obj_03)
       (pred_1  obj_04 obj_08)
       (pred_1  obj_03 obj_02)
       (pred_9 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_05)
       (pred_9 obj_01)
       (pred_9 obj_20)
       (pred_9 obj_13)
       (pred_9 obj_15)
       (pred_9 obj_12)
       (pred_9 obj_07)
       (pred_9 obj_19)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_06)
       (pred_9 obj_11)

       (pred_5  obj_18 obj_08)
       (pred_5  obj_09 obj_02)
       (pred_10 obj_18 obj_12)
       (pred_10 obj_09 obj_06)
       (pred_11 obj_16)
    )

    (:goal (and
       (pred_10 obj_18 obj_14)
    ))
(:constraints
  (always (not (pred_11 obj_20)))
)
)

; plan
1. (op_5 obj_16 obj_14)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_14)
   goals met: 0 of 1
2. (op_5 obj_14 obj_05)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_05)
   goals met: 0 of 1
3. (op_5 obj_05 obj_13)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_13)
   goals met: 0 of 1
4. (op_5 obj_13 obj_19)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_19)
   goals met: 0 of 1
5. (op_5 obj_19 obj_07)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_07)
   goals met: 0 of 1
6. (op_5 obj_07 obj_12)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_12)
   goals met: 0 of 1
7. (op_2 obj_12 obj_18)
   deleted: (pred_10 obj_18 obj_12) (pred_4)
   added: (pred_3 obj_18)
   goals met: 0 of 1
8. (op_5 obj_12 obj_07)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_07)
   goals met: 0 of 1
9. (op_3 obj_07 obj_04 obj_18 obj_08)
   deleted: (pred_6 obj_04)
   added: (pred_9 obj_04)
   goals met: 0 of 1
10. (op_5 obj_07 obj_04)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_04)
   goals met: 0 of 1
11. (op_5 obj_04 obj_14)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_14)
   goals met: 0 of 1
12. (op_1 obj_14 obj_18)
   deleted: (pred_3 obj_18)
   added: (pred_4) (pred_10 obj_18 obj_14)
   goals met: 1 of 1
